Repository: lengponay/lucafe
Catalog: lib/l10n/app_*.arb
Languages: km, ko, zh

source: Welcome to LU Coffee
km: សូមស្វាគមន៍មកកាន់ LU Coffee
ko: LU Coffee에 오신 것을 환영합니다
zh: 欢迎来到 LU Coffee

source: Coffee Makes Everything Better!!
km: កាហ្វេធ្វើអោយអ្វីៗកាន់តែប្រសើរ!!
ko: 커피와 함께 향긋한 하루를 시작하세요!
zh: 咖啡让一切变得更加美好！！

source: Get Started
km: ចាប់ផ្តើម
ko: 들어가기
zh: 开始

# hello
source: Hello {username}
km: សួស្តី {username}
ko: 안녕하세요 {username}
zh: 你好 {username}

source: Recommended Drink
km: ភេសជ្ជៈដែលបានណែនាំ
ko: 추천 음료
zh: 推荐饮品

source: What Do You Want To Have Today?
km: តើអ្នកចង់បានអ្វីថ្ងៃនេះ?
ko: 주문 하시겠어요?
zh: 今天您想喝点什么？

source: Life University & FC Events
km: ព្រឹត្តិការណ៍LU និង FC
ko: 라이프 대학교 및 FC 이벤트
zh: 生命大学与 Life FC 活动

source: See More
km: មើល​បន្ថែម​ទៀត
ko: 더보기
zh: 查看更多

source: Cold Coffee
km: កាហ្វេត្រជាក់
ko: 아이스 커피
zh: 冷咖啡

source: Hot Coffee
km: កាហ្វេក្តៅ
ko: 뜨거운 커피
zh: 热咖啡

source: Tea
km: តែ
ko: 티
zh: 茶

source: Milk Tea
km: តែ​ទឹកដោះគោ
ko: 밀크티
zh: 奶茶

source: Soft drink
km: ភេសជ្ជៈ
ko: 음료
zh: 饮料

source: Iced Cappucino
km: Cappuccino ទឹកកក
ko: 아이스 카푸치노
zh: 冰卡布奇诺

source: Iced Latte
km: ឡាតេទឹកកក
ko: 아이스 라떼
zh: 冰拿铁

source: Iced Americano
km: អាមេរិកាំងទឹកកក
ko: 아이스 아메리카노
zh: 冰美式咖啡

source: Iced Mocha
km: Mocha ទឹកកក
ko: 아이스 모카
zh: 冰摩卡

source: Iced Vanilla Latte
km: វ៉ានីឡាឡាតេទឹកកក
ko: 아이스 바닐라 라떼
zh: 冰香草拿铁

source: Iced Caramel
km: Caramel ទឹកកក
ko: 아이스 카라멜 라떼
zh: 冰焦糖玛奇朵

source: Hazelnut Latte
ko: 헤이즐넛 라떼
zh: 榛果拿铁

source: Hot Latte
km: ឡាតេក្តៅ
ko: 핫 라떼
zh: 热拿铁

source: Hot Vanilla Latte
km: វ៉ានីឡាឡាតេក្តៅ
ko: 핫 바닐라 라떼
zh: 热香草拿铁

source: Hot Americano
km: អាមេរិកក្តៅ
ko: 핫 아메리카노
zh: 热美式咖啡

source: Iced Green Tea
km: តែបៃតង
ko: 아이스 그린티
zh: 冰绿茶

source: Passion Tea
km: តែ​ផាសិន​
ko: 패션후르츠 티
zh: 百香果茶

source: Olong Tea
km: តែអូឡុង
ko: 우롱티
zh: 乌龙茶

source: Ovaltine
km: អូវ៉ាល់ទីន
ko: 초코음료
zh: 巧克力

source: Bubble Tea
ko: 버블티
zh: 珍珠奶茶

source: Olong Milk Tea
km: តែទឹកដោះគោអូឡុង
ko: 우롱 밀크티
zh: 乌龙奶茶

source: Olatte
ko: 오라떼

source: Sprite
ko: 스프라이트
zh: 雪碧

source: Pepsi
ko: 펩시
zh: 百事可乐

source: Coke
ko: 코카콜라
zh: 可口可乐

# openFromSevenAMtoFivePM
source: Open From 7am to 5pm
km: បើកពីម៉ោងប្រាំពីរព្រឹកដល់ប្រាំល្ងាច
ko: 영업시간: 7:00AM ~ 5:00PM
zh: 营业时间: 早上 7:00 到 晚上 5:00

source: Self Pick-up at the LU Coffee
km: មកយកខ្លួនឯងនៅ LU Coffee
ko: 주문하신 음료를 LU카페에서 픽업해주세요
zh: 请前往LU Coffee自取

source: Order Summary
km: សេចក្តីសង្ខេបនៃការបញ្ជាទិញ
ko: 주문 내용
zh: 订单摘要

source: Your Order Summary
km: សេចក្តីសង្ខេបនៃការបញ្ជាទិញរបស់អ្នក។
ko: 주문 확인
zh: 您的订单摘要

source: Apply Coupon
km: ​បំពេញគូប៉ុង
ko: 쿠폰 사용
zh: 使用优惠券

source: Bill Summary
km: សង្ខេបវិក័យប័ត្រ
ko: 결제 요약
zh: 账单摘要

source: SubTotal
km: សរុបរង
ko: 합계
zh: 小计

source: Discount
km: ការបញ្ចុះតម្លៃ
ko: 할인
zh: 折扣

source: Total
km: សរុប
ko: 총 합계
zh: 总计

source: Confirm Order
km: បញ្ជាក់​ការ​បញ្ជាទិញ
ko: 주문하기
zh: 确认订单

source: Payment Method
km: វិធី​សា​ស្រ្ត​ទូទាត់
ko: 결제방법
zh: 支付方式

source: Cash Payment
km: ការទូទាត់សាច់ប្រាក់
ko: 현금결제
zh: 现金支付

source: Credit Card or Bank
km: កាតឥណទាន ឬធនាគារ
ko: 신용/체크카드
zh: 银行卡支付

source: Pick up at LU Coffee
km: មកទទួលយកនៅ LU Coffee
ko: 픽업장소: LU Coffee
zh: 请前往LUCoffee取货

source: Place Order
km: ដាក់បញ្ជា
ko: 주문 확정하기
zh: 下单

source: Tracking Order
km: តាមដានការបញ្ជាទិញ
ko: 주문 현황
zh: 跟踪订单

source: Order Number
km: លេខ​លំដាប់
ko: 주문 번호
zh: 订单号

source: Estimate Preparing Time
km: ការប៉ាន់ស្មានពេលវេលារៀបចំ
ko: 예상 소요 시간
zh: 预计准备时间

source: Confirm Pick up
km: បញ្ជាក់ការទទួល
ko: 픽업하기
zh: 确认取货

source: Order Served
km: បញ្ជាទិញបានបម្រើ
ko: 주문이 완료되었습니다
zh: 订单已完成

source: profile
km: ប្រវត្តិរូប
ko: 프로필
zh: 个人资料

source: Account
km: គណនី
ko: 계정
zh: 账户

source: Language
km: ភាសា
ko: 언어
zh: 语言

# notifications
source: Notification
km: ការជូនដំណឹង
ko: 공지사항
zh: 通知

source: Dark Mode
km: មុខងារងងឹត
ko: 다크모드
zh: 夜间模式

source: Change Password
km: ផ្លាស់ប្តូរពាក្យសម្ងាត់
ko: 비밀번호 변경하기
zh: 更改密码

source: Log Out
km: ចាកចេញ
ko: 로그아웃
zh: 退出账号

source: Add to Cart
km: បន្ថែមទៅរទេះ
ko: 장바구니
zh: 加入购物车

source: Current Password
km: លេខសំងាត់​បច្ចុប្បន្ន
ko: 현재 비밀번호
zh: 当前密码

source: New Password
km: ពាក្យសម្ងាត់​ថ្មី
ko: 새로운 비밀번호
zh: 新密码

source: Confirm Password
km: បញ្ជាក់ពាក្យសម្ងាត់
ko: 비밀번호 확인
zh: 确认密码

source: Submit
km: ដាក់ស្នើ
ko: 확인
zh: 提交

source: Delete Account
km: លុប​គណនី
ko: 계정 삭제
zh: 删除账号

source: Edit Profile
km: កែសម្រួលប្រវត្តិរូប
ko: 프로필 변경
zh: 编辑个人资料

source: Setting
km: ការកំណត់
ko: 설정
zh: 设置

source: Save
km: រក្សាទុក
ko: 저장
zh: 保存

source: Gender
km: ភេទ
ko: 성별
zh: 性别

source: Last Name
km: នាមត្រកូល
ko: 성
zh: 名

source: First Name
km: ឈ្មោះ
ko: 이름
zh: 姓

source: Email
km: អ៊ីម៉ែល
ko: 이메일
zh: 电子邮件

source: Are you sure to Log out?
km: តើអ្នកប្រាកដក្នុងការចេញ?
ko: 로그아웃하시겠습니까?
zh: 您确定要退出吗

source: Cancel
km: បោះបង់
ko: 취소
zh: 取消

source: Verify Password is incorrect
km: ផ្ទៀងផ្ទាត់ពាក្យសម្ងាត់មិនត្រឹមត្រូវ
ko: 비밀번호 확인이 올바르지 않습니다
zh: 验证密码不正确

# mustBeAtLeastEightCharacters
source: Must be at least 8 characters
km: ត្រូវតែមានយ៉ាងហោចណាស់ 8 តួអក្សរ
ko: 8자 이상이어야 합니다
zh: 必须至少包含 8 个字符

source: Your password is not confirm
km: ពាក្យសម្ងាត់របស់អ្នកមិនត្រូវបានបញ្ជាក់
ko: 비밀번호가 확인되지 않았습니다
zh: 您的密码未确认

source: Success
km: ជោគជ័យ
ko: 성공
zh: 成功

source: Phone Number
km: លេខទូរសព្ទ
ko: 전화 번호
zh: 电话号码

source: Menu
km: ម៉ឺនុយ
ko: 메뉴
zh: 菜单

# rating
source: Rating 9.5 / 10
km: ការវាយតម្លៃ 9.5/10
ko: 평점 9.5 /10
zh: 评分 9.5 /10

source: Register Now
km: ចុះឈ្មោះ​ឥឡូវនេះ
ko: 지금 등록하세요
zh: 现在注册

source: Not have an account?
km: មិនមានគណនីមែនទេ?
ko: 계정이 없으신가요?
zh: 沒有帳戶？

source: Sign In
km: ចូល
ko: 로그인
zh: 登录

source: Or Continue With
km: ឬបន្តជាមួយ
ko: 또는 계속
zh: 或继续

source: Username
km: ឈ្មោះអ្នកប្រើប្រាស់
ko: 사용자 이름
zh: 用户名

source: forgot Password
km: ភ្លេចពាក្យសម្ងាត់
ko: 비밀번호를 잊어버림
zh: 忘记密码

source: Password
km: ពាក្យ​សម្ងាត់
ko: 비밀번호
zh: 密码

source: Email Address or Phone Number
km: អាសយដ្ឋានអ៊ីមែល ឬលេខទូរស័ព្ទ
ko: 이메일 주소 또는 전화번호
zh: 电子邮件地址或电话号码

source: Already Have Account?
km: មានគណនីរួចហើយ?
ko: 이미 계정이 있나요?
zh: 已有帐户？

source: Sign Up
km: ចុះឈ្មោះ
ko: 가입하기
zh: 注册

source: Normal Sugar
km: ស្ករធម្មតា
ko: 일반 설탕
zh: 正常糖

source: Less Sugar
km: ស្ករតិច
ko: 설탕 감소
zh: 少糖

source: More Sugar
km: ស្ករច្រើន
ko: 설탕 증가
zh: 多糖

source: No Sugar
km: គ្មានស្ករ
ko: 설탕 없음
zh: 无糖

source: Age
km: អាយុ
ko: 나이
zh: 年龄

# equalPartsEspressoSteamMilkAndMilkFaom
source: Equal parts espresso, steamed milk, and milk foam
km: ផ្នែកស្មើគ្នា espresso ទឹកដោះគោចំហុយ និងពពុះទឹកដោះគោ
ko: 에스프레소, 스팀 밀크, 밀크 폼을 같은 양으로 섞은 것
zh: 等份浓缩咖啡、蒸牛奶和奶泡

source: Espresso with chilled milk over ice
km: Espresso ជាមួយទឹកដោះគោត្រជាក់លើទឹកកក
ko: 얼음 위에 차가운 우유를 넣은 에스프레소
zh: 浓缩咖啡加冰块，冷牛

# espressonDilutedWithHotWaterForASmoothTaste
source: Espresso diluted with hot water for a smooth taste
km: Espresso ពនឺជាមួយទឹកក្តៅ ដើម្បីអោយរសជាតិរលោង
ko: 부드러운 맛을 위해 뜨거운 물에 희석한 에스프레소
zh: 浓缩咖啡加热水稀释，口感顺滑

# espressoMixedWtihSteamedMilkAndChoco
source: Espresso mixed with steamed milk and choco
km: Espresso លាយជាមួយទឹកដោះគោចំហុយ និងសូកូឡា
ko: 스팀 밀크와 초코를 섞은 에스프레소
zh: 浓缩咖啡加蒸牛奶和巧克力

# espresonWithSteamedMilkAndVanillaSyrup
source: Espresso with steamed milk and vanilla syrup
km: Espresso ជាមួយទឹកដោះគោចំហុយនិងសុីរ៉ូវ៉ានីឡា
ko: 스팀 밀크와 바닐라 시럽을 넣은 에스프레소
zh: 浓缩咖啡加蒸牛奶和香草糖浆

# espressoWithSteamMilkAndSyrup
source: Espresso with steamed milk and syrup
km: Espresso ជាមួយទឹកដោះគោចំហុយនិងសុីរ៉ូ
ko: 스팀 밀크와 시럽을 넣은 에스프레소
zh: 浓缩咖啡加蒸牛奶和糖浆

# espressonWithSteamedMilkAndHazenutSyrup
source: Espresso with steamed milk and hazelnut syrup
km: Espresso ជាមួយទឹកដោះគោចំហុយ និងសុីរ៉ូ hazelnut
ko: 스팀 밀크를 넣은 에스프레소
zh: 浓缩咖啡加蒸牛奶和榛子糖浆

# espressoWithSteamMilk
source: Espresso with steamed milk
km: Espresso ជាមួយទឹកដោះគោចំហុយ
ko: 스팀 밀크와 시럽을 넣은 에스프레소
zh: 浓缩咖啡加蒸牛奶

source: steamed milk, Vanilla syrup
km: ទឹកដោះគោចំហុយ, សុីរ៉ូវ៉ានីឡា
ko: 스팀 밀크, 바닐라 시럽
zh: 蒸牛奶，香草糖浆

source: Espresso with hot water
km: Espresso ជាមួយទឹកក្តៅ
ko: 뜨거운 물에 넣은 에스프레소
zh: 浓缩咖啡加热水

source: Refreshing green tea served over ice
km: តែបៃតងស្រស់ បម្រើលើទឹកកក
ko: 얼음 위에 얹은 상쾌한 녹차
zh: 清爽绿茶加冰块

# aVibrantTropicalBlendOfHibiscusAndFruitFlavor
source: A vibrant, tropical blend of hibiscus and fruit flavors
km: ការលាយបញ្ចូលគ្នាដ៏រស់រវើកនៃតំបន់ត្រូពិចនៃ hibiscus និងរសជាតិផ្លែឈើ
ko: 히비스커스와 과일 풍미의 생동감 넘치는 열대적 블렌드
zh: 芙蓉和水果风味的热带混合

# smoothOlongTeaToppedWithACreamyMilkFoam
source: Smooth oolong tea topped with a creamy milk foam
km: តែ oolong រលោង លាបជាមួយពពុះទឹកដោះគោ
ko: 크림 같은 밀크 폼을 얹은 부드러운 우롱차
zh: 顺滑乌龙茶，顶部有奶油奶泡

source: Refreshing chocolate served over ice
km: សូកូឡាស្រស់ បម្រើលើទឹកកក
ko: 얼음 위에 얹은 상쾌한 초콜릿
zh: 清爽巧克力加冰块

# teaWtihBubbleInsideFresh
source: Tea with bubble inside, fresh
km: តែជាមួយពពុះនៅខាងក្នុង, ស្រស់ស្រាយ
ko: 안에 거품이 든 차, 신선함
zh: 内含气泡的茶，新鲜

# teaWithBubbleInsiderBoostingYourEnergy
source: Tea with bubble inside, boosting your energy
km: តែមានពពុះនៅខាងក្នុង បង្កើនថាមពលរបស់អ្នក
ko: 거품이 든 차 안에, 당신의 에너지를 북돋아줍니다
zh: 内含气泡的茶，提升您的能量

source: Olong tea, make your day like tea
km: តែ Olong, ធ្វើឱ្យថ្ងៃរបស់អ្នកដូចជាតែ
ko: 올롱차, 당신의 하루를 차처럼 만들어줍니다
zh: 乌龙茶，让你的一天像茶一样

source: Ovaltine, boost your energy and refresh your day
km: អូវ៉ាល់ទីន បង្កើនថាមពល និងធ្វើឱ្យថ្ងៃរបស់អ្នកស្រស់ស្រាយ
ko: 오발틴, 당신의 에너지를 북돋우고 당신의 하루를 상쾌하게 해줍니다
zh: 阿华田，让你的能量倍增，让你的一天焕然一新

source: Special Olatte, plus the vitamins inside
km: Olatte ពិសេស បូកបញ្ចូលវីតាមីនខាងក្នុង
ko: 특별한 올라떼, 그리고 비타민이 들어있습니다
zh: 特别的奥拉特，加上里面的维生素

# spriteBoostYourMoodAndHapptWithSprite
source: Sprite, boost your mood and happy with sprite
km: Sprite, បង្កើនអារម្មណ៍របស់អ្នកនិងរីករាយជាមួយ sprite
ko: 스프라이트, 스프라이트로 당신의 기분과 행복을 북돋아줍니다
zh: 雪碧，让你的心情愉悦，喝上雪碧

source: With Pepsi, everything is yummy and fun
km: ជាមួយ Pepsi អ្វីគ្រប់យ៉ាងគឺឆ្ងាញ់និងរីករាយ
ko: 펩시와 함께라면 모든 것이 맛있고 즐겁습니다
zh: 有了百事可乐，一切都变得美味又有趣

# cokeMakerYourFoodMoreDeliciousAndMoreEnjoyable
source: Coke, Make your food more delicious and more enjoyable
km: កូកា ធ្វើឱ្យអាហាររបស់អ្នកកាន់តែឆ្ងាញ់ និងកាន់តែរីករាយ
ko: 코카콜라, 당신의 음식을 더 맛있고 더 즐겁게 만들어줍니다
zh: 可口可乐，让你的食物更美味，更令人愉悦

# remarkYourWordhereEgSugar70
source: Remark your words here. e.g : sugar 70%
km: ចំណាំពាក្យរបស់អ្នកនៅទីនេះ។ ឧ: ស្ករ 70%
ko: 여기에 단어를 표시하세요. 예: sugar 70%
zh: 在此记下您的单词。例如：糖 70%

source: Delete
km: លុប
ko: 삭제
zh: 删除

source: Your Bill Summary
km: សង្ខេបវិក័យប័ត្ររបស់អ្នក
ko: 귀하의 청구 요약
zh: 您的账单摘要

# yourOrderHasAlreadyBeenServedThankYou
source: Your order has been served. Thank you :)
km: ការបញ្ជាទិញរបស់អ្នកត្រូវបានបម្រើ។ សូមអរគុណ :)
ko: 주문이 처리되었습니다. 감사합니다 :)
zh: 您的订单已送达。谢谢 :)

source: Back To Home
km: ត្រលប់​ទៅផ្ទះ
ko: 홈으로 돌아가기
zh: 返回主页

# orderCode
source: Order Number: #168168
km: លេខបញ្ជាទិញ៖ #168168
ko: 주문 번호: #168168
zh: 订单号: #168168

# fiveToTenMins
source: 5 - 10 mins
km: 5 - 10 នាទី
ko: 5 - 10분
zh: 5 - 10 分钟

source: Status
km: ស្ថានភាព
ko: 상태
zh: 状态

# ninePointFiveOneHundredRating
source: 9.5 (100+ ratings)
km: 9.5 (100+ ការវាយតម្លៃ)
ko: 9.5(100개 이상의 평가)
zh: 9.5 (100+ 评分)

# eightAM
source: 8:00 AM
km: 8:00 ព្រឹក
ko: 오전 8시
zh: 上午 8:00

source: Order Placed
km: បញ្ជាទិញ
ko: 주문 완료
zh: 已下单

# yourOrderCodeWasPlacedForDelivery
source: Your order #12345 was placed for delivery.
km: ការបញ្ជាទិញរបស់អ្នក #12345 ត្រូវបានដាក់សម្រាប់ការដឹកជញ្ជូន
ko: 주문 #12345가 배달되었습니다.
zh: 您的订单 #12345 已下单，等待配送。

# eightFifteen
source: 8:15 AM
km: 8:15 ព្រឹក
ko: 오전 8시 15분
zh: 上午 8:15

source: Pending
km: កំពុងរង់ចាំ
ko: 보류 중
zh: 待处理

source: Your order is pending for confirmation.
km: ការបញ្ជាទិញរបស់អ្នកកំពុងរង់ចាំការបញ្ជាក់
ko: 주문이 확인을 위해 보류 중입니다.
zh: 您的订单正在等待确认。

# eightThirty
source: 8:30 AM
km: 8:30 ព្រឹក
ko: 오전 8시 30분
zh: 上午 8:30

source: Confirmed
km: បញ្ជាក់
ko: 확인됨
zh: 已确认

source: Your order is confirmed and will be ready soon.
km: ការបញ្ជាទិញរបស់អ្នកត្រូវបានបញ្ជាក់ ហើយនឹងរួចរាល់ក្នុងពេលឆាប់ៗនេះ
ko: 주문이 확인되었으며 곧 준비될 예정입니다.
zh: 您的订单已确认，将很快准备好。

# eightFortyFive
source: 8:45 AM
km: 8:45 ព្រឹក
ko: 오전 8시 45분
zh: 上午 8:45

source: Processing
km: ដំណើរការ
ko: 처리 중
zh: 处理中

source: Your product is ready for picked up.
km: ផលិតផលរបស់អ្នករួចរាល់សម្រាប់ការយកហើយ
ko: 제품을 픽업할 준비가 되었습니다.
zh: 您的产品已准备好供您取货。

# nineAM
source: 9:00 AM
km: 9:00 ព្រឹក
ko: 오전 9시
zh: 上午 9:00

source: Delivered
km: បានប្រគល់
ko: 배달됨
zh: 已送达

source: Product delivered to you and marked as delivered.
km: ផលិតផល​បាន​ប្រគល់​ឱ្យ​អ្នក​ហើយ​ត្រូវ​បាន​សម្គាល់​ថា​បាន​បញ្ជូន
ko: 제품이 귀하에게 배달되었으며 배달됨으로 표시되었습니다.
zh: 产品已送达您并标记为已送达。

source: Sugar Level
km: កម្រិត​ស្ករ
ko: 당 수치
zh: 糖度

# optional
source: Optional (+$0.00)
km: ជម្រើស​ (+$0.00)
ko: 선택 사항 (+$0.00)
zh: 可选 (+$0.00)

source: OK
km: យល់ព្រម
ko: 확인
zh: 确定

source: Successfully added to cart
km: បញ្ចូល​ទៅ​ក្នុង​កន្រ្តកដោយ​ជោគជ័យ
ko: 장바구니에 성공적으로 추가되었습니다
zh: 已成功添加到购物车

source: verifyPassword
km: ផ្ទៀងផ្ទាត់​ពាក្យសម្ងាត់
